{
  "recipes": [
    {
      "name": "Simple Salad",
      "ingredientIds": [
        12,
        11,
        19
      ],
      "description": "A simlple salad\n\nSteps:\n1. Cut all ingredients into small pieces\n2. Combine in one bowl and enjoy!\n"
    },
    {
      "name": "Braised Eggplant",
      "ingredientIds": [
        13,
        17
      ],
      "description": "Easy way to make braised eggplant\n\nSteps:\n1. Wash and cut the eggplant into hob blocks.\n2. Heat the oil, put the eggplant in the pan and fry it immediately.\n3. Put two spoons of oil in the pan, saute the dried chili and garlic, and then add the fried eggplant.\n4. Add soy sauce, sugar, wine, stir fry.\n5. Add a few water, salt, and soup.\n6. Add some chicken essence before cooking, sprinkle some green onion, or you can pick up the thick."
    },
    {
      "name": "Beef Stew with Tomato",
      "ingredientIds": [
        1,
        11,
        18
      ],
      "description": "A delicacy with a rich taste, delicious sweet and sour, the main ingredients are tomato and beef\n\nSteps:\n1. Wash and cut the beef into small cubes, mince ginger and scallion.\n2. Ignite the pot and when the oil is 5-6% hot, gradually fry the beef and remove it.\n3. Leave the bottom oil in the pan and add the fried beef, put water (preferably submerged meat), add clear sauce, ginger, cooking wine, spring onion, grass fruit, salt to season.\n4. Soak the tomatoes in boiling water for a while, remove them, peel them, cut them into crescent blocks, and put them in a pot."
    },
    {
      "name": "Chicken Stew with Potatoes",
      "ingredientIds": [
        5,
        10,
        18
      ],
      "description": "A simlple recipe for chicken.\n\nSteps:\n1. Cut the chicken into pieces, mix with salt, cooking wine, soy sauce, scallions and marinate for 15 minutes\n2. Peel and cut potatoes into 1cm cubes.\n3. Heat oil in the pan, stir-fry chicken with green onion and ginger until the chicken is discolored, most of the moisture disappears, stir-fry with soy sauce and potatoes for 2 minutes.\n4. Add water and the ingredients are flush, put salt, boil on high heat, simmer for 20 minutes on low heat, add a few dried chili to medium heat to collect the soup!"
    },
    {
      "name": "Vinegar Potato Chips",
      "ingredientIds": [
        10,
        17
      ],
      "description": "Vinegar potato chips, sour and spicy, suitable for all ages.\n\nSteps:\n1. Cut potatoes into shreds and mince garlic. Soak the shredded potatoes in the water to get the starch out, which makes it more crispy.\n2. Add hot pepper and minced garlic and saute\n3. Add dried chili and shred potatoes, stir fry, stir fry potatoes, add salt, chicken essence, vinegar and stir fry\n4. Click on the sesame oil to get out of the pan. The stir-fry process takes two or three minutes, and the fried potatoes are sour, spicy and crispy."
    },
    {
      "name": "Coke Chicken",
      "ingredientIds": [
        5,
        18
      ],
      "description": "Coke Chicken, essential dishes for New Year.\n\nSteps:\n1. Wash the chicken, boil them in scallion and ginger water, and drain.\n2. Put a little oil in the pan to heat it up and add chicken, fry until yellow on both sides of the outer skin.\n3. Pour the coke without chicken.\n4. Add soy sauce, big ingredients, spring onion, ginger slices, turn to a low heat after boiling, simmer until the soup is thick."
    },
     {
      "name": "Simple Salmon Chowder ",
      "ingredientIds": [
        0,
        10,
        24
      ],
      "description": "Simple Salmon Chowder\n\nSteps:\n1. Cut the salmon into pieces.\n2. Once the potatoes are tender, you’ll add milk, cream or coconut milk to the pot\n3.And then you will poach the salmon, right in the creamy broth,This will only take a couple of minutes before turning the heat off.\n4Flake apart the fish with a fork and adjust seasonings to your liking. Serve immediately."

    },
    {
      "name": "Sweet 'n Sticky Apricot Chicken",
      "ingredientIds": [
        5 ,
        17,
        19
      ],
      "description": "Sweet 'n Sticky Apricot Chicken\n\nSteps:\n1. 2 lb. (900 g) bone-in chicken pieces (legs, thighs, wings),1/2 cup apricot jam.1/2 cup Heinz Chili Sauce,1 Tbsp. Heinz Distilled White Vinegar,5.3 cloves garlic, minced\n2.Bake 45 min. or until chicken is done (165°F)."
    },
    {
      "name": "Beef Pot Roast with Braised Vegetables",
      "ingredientIds": [
        1,
        18,
        19
      ],
      "description": "Beef Pot Roast with Braised Vegetables\n\nSteps:\n1. 2 tbsp (30 mL) fennel seeds, crushed\n 1 tsp (5 mL) EACH salt and pepper\n 3 lb (1.36 kg) Boneless Beef Pot Roast (e.g. Cross Rib, Blade or Top Blade)\n 3 tbsp (45 mL) vegetable oil\n 2 onions, chopped\n 4 carrots, diced\n 2 tbsp (30 mL) all-purpose flour\n 1 ½ cups (375 mL) beef stock\n 3 bay leaves\n2. 1. Combine crushed fennel seeds with 1/2 tsp (2 mL) each of the salt and pepper, rub all over roast. In Dutch oven or stockpot, heat 2 tbsp (30 mL) of the oil over medium-high heat; brown beef all over, turning with tongs, about 10 minutes. Transfer pot roast to slow-cooker; set aside. Reduce stove-top heat to medium. Add remaining oil to Dutch oven if necessary; cook onions, carrots and remaining salt and pepper, stirring, for 4 minutes or until just golden. Sprinkle with flour; cook, stirring, for 1 minute.\n\n2. Add beef stock and bay leaves to Dutch oven; bring to boil, stirring and scraping up brown bits from bottom of pot. Transfer vegetables, broth and bay leaves to slow-cooker. Cover and cook on LOW for 7 to 8 hours or until fork tender.\n\n3. Remove bay leaves and discard; skim fat from sauce if necessary. Carve roast across the grain and serve with sauce and braised vegetables.\n"
    }
  ]
}
